bierner.markdown-mermaid
charliermarsh.ruff
cweijan.vscode-database-client2
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
github.copilot-chat
github.vscode-github-actions
google.geminicodeassist
humao.rest-client
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ossdata.vscode-pgsql
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-wsl
shopify.ruby-lsp
sst-dev.opencode
typespec.typespec-vscode
